Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionPlacingAttributes
The DimensionPlacingAttributes class controls the placing of the dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionPlacingAttributes.Placing
The placing type.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionPlacingAttributes.Direction
The placing direction.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionPlacingAttributes.Distance
The placing distance attributes.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionPlacingAttributes.#ctor
Creates a new dimension placing attributes instance. The placing is set to the free placing.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionPlacingAttributes.#ctor(Tekla.Structures.Drawing.DimensionSetBaseAttributes.Placings,Tekla.Structures.Drawing.PlacingDirectionAttributes,Tekla.Structures.Drawing.PlacingDistanceAttributes)
Creates a new dimension placing attributes instance with the given parameters.
placing: The placing type of the dimension.
direction: The placing direction attributes of the dimension.
distance: The placing distance attributes of the dimension.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.DimensionPlacingAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.